src_Extension/Reports/ТрудозатратыНаВыпуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ТрудозатратыНаВыпуск</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаПроизводство</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГОЗ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изделие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

src_Extension/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияБезПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеТоваровМеждуФилиалами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияКлиентуРеглУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриемНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаМатериаловВКладовую</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаМатериаловВПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаПродукцииИзКладовой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаПродукцииИзПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияЧерезКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияЧерезКомиссионераБезПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеОтПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроизводствоУПереработчика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_Extension/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>15</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачатьНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_Extension/Documents/ДвижениеПродукцииИМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДвижениеПродукцииИМатериалов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжение</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_Extension/Reports/ТрудозатратыНаВыпуск/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, 
		КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	//КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	
	НайденныйПараметр = Неопределено;
    НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
    Если НайденныйПараметрВарианта <> Неопределено Тогда
        НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр = Неопределено тогда
		ВызватьИсключение "Не задан период!";
	КонецЕсли;
	Период = НайденныйПараметр.Значение;
	НайденныйПараметр = Неопределено;
    НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СкладыГП");
    Если НайденныйПараметрВарианта <> Неопределено Тогда
        НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр <> Неопределено тогда
		СкладыГП = НайденныйПараметр.Значение;
	КонецЕсли;
	Изделия = ПолучитьПланПроизводства(Период.ДатаНачала,Период.ДатаОкончания,СкладыГП);
	
	РассчитатьМатериалы(Изделия);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Материалы", Материалы);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
 	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСпецификацию(Изд)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказНаПроизводство2_2Продукция.Спецификация КАК Спецификация
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
		|ГДЕ
		|	ЗаказНаПроизводство2_2Продукция.Ссылка.Проведен
		|	И ЗаказНаПроизводство2_2Продукция.Ссылка.Дата < &Дата
		|	И ЗаказНаПроизводство2_2Продукция.Номенклатура = &Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНаПроизводство2_2Продукция.Ссылка.Дата УБЫВ";
	Запрос.УстановитьПараметр("Номенклатура",Изд.Номенклатура);
	Запрос.УстановитьПараметр("Дата",Период.ДатаОкончания);
	Выб = Запрос.Выполнить().Выбрать();
	Если НЕ Выб.Следующий() тогда
		ВызватьИсключение "Нет спецификации "+Изд.Номенклатура.Наименование;
	КонецЕсли;
	Изд.Спецификация = Выб.Спецификация;
КонецПроцедуры

&НаСервере
Процедура РассчитатьМатериалы(Изделия)
	Если Изделия.Количество()<=0 тогда
		ВызватьИсключение "В плане нет изделий!";
	КонецЕсли;
	
	Материалы.Очистить();
	
	Для каждого Изд из Изделия цикл
		Если НЕ ЗначениеЗаполнено(Изд.Спецификация) тогда
			ПолучитьСпецификацию(Изд);
		КонецЕсли;
	КонецЦикла;
	
	МенеджерВТ = ЭТП.РасчитатьМатериалы(Изделия, Истина);
	ЭТП.ПолучитьСборки(МенеджерВТ);
	ЗаполнитьТЗ(МенеджерВТ);
	МенеджерВТ.Закрыть();
	
	Заказ0 = Неопределено;
	ГОЗ0 = Неопределено;
	НапрДеят0 = Неопределено;
	Для каждого Мат из Материалы цикл
		СтрИзд = Изделия[Мат.Индекс];
		Мат.ЗаказКлиента = СтрИзд.ЗаказКлиента;  
		Мат.ЗаказНаПроизводство = СтрИзд.ЗаказНаПроизводство;
		Мат.Изделие = СтрИзд.Номенклатура;
		Мат.КоличествоИ = СтрИзд.Количество;
		Мат.КодОперации = СтрИзд.КодОперации;   
		Если НЕ ЗначениеЗаполнено(Мат.ЗаказКлиента) тогда
			Заказ0 = Неопределено;
			НапрДеят = Мат.ЗаказНаПроизводство.НаправлениеДеятельности;
			Если НапрДеят <> НапрДеят0 тогда           
				НапрДеят0 = НапрДеят;
				ГОЗ0 = ЭТП.ДогСпецГКДляПечати(,НапрДеят0);
			КонецЕсли;
		Иначе
			НапрДеят0 = Неопределено;
			Если Мат.ЗаказКлиента <> Заказ0 тогда
				Заказ0 = Мат.ЗаказКлиента;
				ГОЗ0 = ЭТП.ДогСпецГКДляПечати(Заказ0);
			КонецЕсли;
		КонецЕсли;
		Мат.ГОЗ =ГОЗ0;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьПланПроизводства(ДатаНачала, ДатаОкончания, СкладыГП)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ДвижениеПродукцииИМатериаловТовары.Распоряжение.Распоряжение.ДокументОснование КАК Документ.ЗаказКлиента) КАК ЗаказКлиента,
		|	ДвижениеПродукцииИМатериаловТовары.Номенклатура КАК Номенклатура,
		|	ДвижениеПродукцииИМатериаловТовары.Количество КАК Количество,
		|	ДвижениеПродукцииИМатериаловТовары.Распоряжение.Спецификация КАК Спецификация,
		|	КодыОперации.КодОперации КАК КодОперации,
		|	ВЫРАЗИТЬ(ДвижениеПродукцииИМатериаловТовары.Распоряжение.Распоряжение КАК Документ.ЗаказНаПроизводство2_2) КАК ЗаказНаПроизводство
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДвижениеПродукцииИМатериаловДополнительныеРеквизиты.Ссылка КАК Ссылка,
		|			ВЫРАЗИТЬ(ДвижениеПродукцииИМатериаловДополнительныеРеквизиты.Значение КАК СТРОКА(2)) КАК КодОперации
		|		ИЗ
		|			Документ.ДвижениеПродукцииИМатериалов.ДополнительныеРеквизиты КАК ДвижениеПродукцииИМатериаловДополнительныеРеквизиты
		|		ГДЕ
		|			ДвижениеПродукцииИМатериаловДополнительныеРеквизиты.Свойство = &СвойствоКО) КАК КодыОперации
		|		ПО ДвижениеПродукцииИМатериаловТовары.Ссылка = КодыОперации.Ссылка
		|ГДЕ
		|	ДвижениеПродукцииИМатериаловТовары.Ссылка.Проведен
		|	И ДвижениеПродукцииИМатериаловТовары.Ссылка.Дата МЕЖДУ &Дата0 И &Дата1
		|	И ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель В(&СкладыГП)
		|	И ДвижениеПродукцииИМатериаловТовары.Ссылка.ХозяйственнаяОперация = &ХозяйственнаяОперация
		|	И ДвижениеПродукцииИМатериаловТовары.Ссылка.Статус.Порядок = 1
		|	И НЕ ДвижениеПродукцииИМатериаловТовары.Распоряжение.Спецификация.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ЗаказКлиента КАК ЗаказКлиента,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	СУММА(ВТ.Количество) КАК Количество,
		|	ВТ.Спецификация КАК Спецификация,
		|	ВТ.КодОперации КАК КодОперации,
		|	ВТ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.ЗаказКлиента,
		|	ВТ.Номенклатура,
		|	ВТ.Спецификация,
		|	ВТ.КодОперации,
		|	ВТ.ЗаказНаПроизводство
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиента";
	Запрос.УстановитьПараметр("Дата0",ДатаНачала);
	Запрос.УстановитьПараметр("Дата1",ДатаОкончания);
	Запрос.УстановитьПараметр("СкладыГП",СкладыГП);
	//СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("14 цех кладовая ГП");
	//Запрос.УстановитьПараметр("СкладОтправитель",СкладОтправитель);
	//ЦехОтправитель = Справочники.СтруктураПредприятия.НайтиПоНаименованию("14 цех");
	//Запрос.УстановитьПараметр("Отправитель",ЦехОтправитель);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства);
	СвойствоКО = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ПеремещениеТоваровКодОперации");
	Если ЗначениеЗаполнено(СвойствоКО) тогда
		Запрос.УстановитьПараметр("СвойствоКО",СвойствоКО);  
	КонецЕсли;
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ЗаполнитьТЗ(МенеджерВТ)
	ВидыРаботФиктивные = Справочники.ВидыРаботСотрудников.НайтиПоНаименованию("Фиктивные");
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = ТекстЗапросаТрудозатраты();
	Запрос.УстановитьПараметр( "ВидыРаботФиктивные", ВидыРаботФиктивные);
	Материалы.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

Функция ТекстЗапросаТрудозатраты();
	Возврат
	"ВЫБРАТЬ
	|	ВТСборки.Спецификация.ОсновноеИзделиеНоменклатура КАК Сборка,
	|	РесурсныеСпецификацииТрудозатраты.Количество * ВТСборки.Количество / ВТСборки.ВыходноеКоличество КАК Норма,
	|	ВТСборки.ГолСпец.ОсновноеИзделиеНоменклатура КАК Изделие,
	|	ВТСборки.Количество КАК Количество,
	|	ВТСборки.Индекс КАК Индекс
	|ПОМЕСТИТЬ ВТТрудозатр
	|ИЗ
	|	ВТСборки КАК ВТСборки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.Трудозатраты КАК РесурсныеСпецификацииТрудозатраты
	|		ПО ВТСборки.Спецификация = РесурсныеСпецификацииТрудозатраты.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(РесурсныеСпецификацииТрудозатраты.ВидРабот.Родитель <> &ВидыРаботФиктивные, ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТрудозатр.Индекс КАК Индекс,
	|	СУММА(ВТТрудозатр.Норма) КАК Норма
	|ИЗ
	|	ВТТрудозатр КАК ВТТрудозатр
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТТрудозатр.Индекс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТрудозатр";
КонецФункции


Функция СведенияОВнешнейОбработке() Экспорт
	Возврат ЭТП.ЗарегистрироватьВнешнийОтчет("ТрудозатратыНаВыпуск",
		"Трудозатраты на выпуск");
КонецФункции
